# 2. Pandas Exercises 

Fill in the blanks with the instruction code for a fulfilled program.

#### Import pandas

In [2]:
import pandas as pd

#### Create a series
create a list of series-> s1= [3, 2, 0, 1] and s2 =[0, 3, 7, 2] then convert them to the Data frame set column in "apple" and "orange"

In [5]:
#create a series of data first, then convert to data dictionary type
s1 = pd.Series([3, 2, 0, 1])
s2 = pd.Series([0, 3, 7, 2])

dataframe = pd.DataFrame({'apple': s1, 'orange': s2})
dataframe

   apple  orange
0      3       0
1      2       3
2      0       7
3      1       2

#### Create a data dictionary of 
data = {
    'weight': [45,50,60,55],  
    'height': [155,156,170,160]
}

In [4]:
#create a data as a dictionary type
data = {'weight': [45, 50, 60, 55], 'height': [155, 156, 170, 160]}
data

{'weight': [45, 50, 60, 55], 'height': [155, 156, 170, 160]}

#### Create Data Frame in "df" from data dictionary

In [9]:
# df => pandas DataFrame object
df = pd.DataFrame(data)
df

   weight  height
0      45     155
1      50     156
2      60     170
3      55     160

#### Set index of Data Frame (df) in ['student#1', 'student#2', 'student#3', 'student#4']

In [13]:
df.index = ['student#1','student#2','student#3','student#4']
df

           weight  height
student#1      45     155
student#2      50     156
student#3      60     170
student#4      55     160

### using function head() to show as first two rows

In [19]:
df_head = df.head(2)
df_head

           weight  height
student#1      45     155
student#2      50     156

### using function tail() to show as last two rows

In [21]:
df_tail = df.tail(2)
df_tail

           weight  height
student#3      60     170
student#4      55     160

### using attribute shape to check shape of data frame

In [23]:
shape = df.shape
shape

(4, 2)

### using attribute info to check information of data frame

In [24]:
df_info = df.info()
df_info

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, student#1 to student#4
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   weight  4 non-null      int64
 1   height  4 non-null      int64
dtypes: int64(2)
memory usage: 96.0+ bytes

### using function loc to find the information of
weight     55
height    160

In [25]:

df_loc =df.loc[(df['weight'] == 55) & (df['height'] == 160)]
df_loc

           weight  height
student#4      55     160

## +++++++++++++++++++++++++++++++++++++++
## Using Read csv file
### nba-2.csv
### create data frame name as "dfNBA"

In [35]:
#same path of folder of file ipython
dfNBA = pd.read_csv('nba-2.csv')

In [39]:
##location of file on Doogle Drive 
# from google.colab import drive
# drive.mount('/content/drive')
# data_dir = "drive/My Drive/SE-Lectures-Materials/Intro to Data Analysis/nba-2.csv"

ModuleNotFoundError: No module named 'google'

### Using function count() to check total of members

In [34]:
dfNBA.count()

Team        457
Number      457
Position    457
Age         457
Height      457
Weight      457
College     373
Salary      446
dtype: int64

### Using function set_index() to set column "Name" to be index data
then show first 10 rows records

In [36]:

dfNBA.set_index("Name", inplace=True)
print(dfNBA)

                         Team  Number Position   Age Height  Weight  \
Name
Avery Bradley  Boston Celtics     0.0       PG  25.0    6-2   180.0
Jae Crowder    Boston Celtics    99.0       SF  25.0    6-6   235.0
John Holland   Boston Celtics    30.0       SG  27.0    6-5   205.0
R.J. Hunter    Boston Celtics    28.0       SG  22.0    6-5   185.0
Jonas Jerebko  Boston Celtics     8.0       PF  29.0   6-10   231.0
...                       ...     ...      ...   ...    ...     ...
Shelvin Mack        Utah Jazz     8.0       PG  26.0    6-3   203.0
Raul Neto           Utah Jazz    25.0       PG  24.0    6-1   179.0
Tibor Pleiss        Utah Jazz    21.0        C  26.0    7-3   256.0
Jeff Withey         Utah Jazz    24.0        C  26.0    7-0   231.0
NaN                       NaN     NaN      NaN   NaN    NaN     NaN

                         College     Salary
Name
Avery Bradley              Texas  7730337.0
Jae Crowder            Marquette  6796117.0
John Holland   Boston University        NaN
R.J. Hunter        Georgia State  1148640.0
Jonas Jerebko                NaN  5000000.0
...                          ...        ...
Shelvin Mack              Butler  2433333.0
Raul Neto                    NaN   900000.0
Tibor Pleiss                 NaN  2900000.0
Jeff Withey               Kansas   947276.0
NaN                          NaN        NaN

[458 rows x 8 columns]

### Using attribute loc[ ] to find the information of "Amir Johnson" and "Terry Rozier" which shown in 3 columns ['Age', 'College', 'Salary']

In [37]:
player_info = dfNBA.loc[["Amir Johnson", "Terry Rozier"], ["Age", "College", "Salary"]]
print(player_info)

               Age     College      Salary
Name
Amir Johnson  29.0         NaN  12000000.0
Terry Rozier  22.0  Louisville   1824360.0

### Using function loc() to find the all information in 3 columns ['Age', 'College', 'Salary'] then show first 5 rows

In [38]:
#Selecting all of the rows and some columns
selected_info = dfNBA.loc[:, ['Age', 'College', 'Salary']]
print(selected_info.head())

                Age            College     Salary
Name
Avery Bradley  25.0              Texas  7730337.0
Jae Crowder    25.0          Marquette  6796117.0
John Holland   27.0  Boston University        NaN
R.J. Hunter    22.0      Georgia State  1148640.0
Jonas Jerebko  29.0                NaN  5000000.0

# Good Job!